{
  "backend/main.mo": "Defines the Meowate backend canister with access control, blob storage mixin, user profiles, subscriptions, matches, payments, signaling data, and associated in‑memory maps.",
  "feature_evidence.json": "Feature evidence report listing WebRTC reliability and diagnostics improvements with referenced frontend files and components.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to their high‑level functional summaries across hooks, pages, and components.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Main React app defining routes, theming, layout components, and authentication‑aware routing initialization.",
  "frontend/src/components/Footer.tsx": "Footer with cat‑themed branding, copyright text, caffeine.ai link, and simple navigation buttons.",
  "frontend/src/components/Header.tsx": "Header with navigation, active user counter, identity controls, and animated cat‑themed UI elements.",
  "frontend/src/components/ProfileSetupModal.tsx": "Light wrapper that renders the WelcomeAccountSetup component for onboarding.",
  "frontend/src/components/RazorpayConfigModal.tsx": "Modal component for entering and saving Razorpay API and secret keys, using queries to check and update configuration.",
  "frontend/src/components/StripeConfigModal.tsx": "Empty or missing file content.",
  "frontend/src/components/WelcomeAccountSetup.tsx": "Multi‑step onboarding dialog for collecting user profile info, preferences, and completing setup with backend mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, stored identities, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, subscriptions, friends, KYC, signaling, and other operations.",
  "frontend/src/hooks/useWebRTC.ts": "Manages WebRTC voice connections with state tracking, ICE servers, retries, signaling mutations, and stream handling.",
  "frontend/src/hooks/useYouTubeIFramePlayer.ts": "Custom React hook that loads the YouTube IFrame API, initializes a player instance, and exposes play, pause, seek, and time/state helpers.",
  "frontend/src/index.css": "Global Tailwind-based styles defining light/dark themes, animations, accessibility tweaks, and custom utilities.",
  "frontend/src/lib/youtube.ts": "Utilities for parsing YouTube URLs or IDs and generating embed URLs with JS API support.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/FriendsPage.tsx": "Friends list and chat UI with mock messaging, call actions, and navigation to shared video viewing.",
  "frontend/src/pages/HomePage.tsx": "Landing page that handles login, profile checks, and navigation to onboarding or matching.",
  "frontend/src/pages/MatchingPage.tsx": "Voice chat matching flow managing WebRTC, authentication guards, user activity, and connection state transitions.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with common error reasons and guidance, offering retry and alternative payment suggestions.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies payment status, fetches updated subscription data, and shows plan details with a success animation or error message.",
  "frontend/src/pages/ProfilePage.tsx": "Allows users to view and edit their profile, update preferences, and complete KYC verification.",
  "frontend/src/pages/SubscriptionPage.tsx": "Shows available subscription plans and handles creating Razorpay orders and initiating payments for authenticated users.",
  "frontend/src/pages/ViewTogetherPage.tsx": "Enables synchronized YouTube watching between peers with shared playback state, video selection, and remote update handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, fonts, shadows, keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, existing issues, and feature requests for fixing WebRTC connection problems and adding backend matchmaking/presence features."
}