{
  "backend/main.mo": "Actor defining authorization, storage mixins, and numerous data types for user profiles, matchmaking, payments (Razorpay/Stripe), signaling, and active user tracking with various ordered maps.",
  "feature_evidence.json": "Feature evidence report specifying TURN‑only WebRTC updates and listing affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short summaries describing their functionality and UI behavior.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app setup with routes, themed layout, background visuals, and authentication‑aware loading of pages.",
  "frontend/src/components/Footer.tsx": "Footer with cat‑themed visuals, attribution link, and simple navigation buttons.",
  "frontend/src/components/Header.tsx": "Header with branding, active user counter, authentication controls, and navigation menus.",
  "frontend/src/components/ProfileSetupModal.tsx": "Thin wrapper rendering the onboarding WelcomeAccountSetup component.",
  "frontend/src/components/RazorpayConfigModal.tsx": "Modal allowing admins to configure Razorpay API keys with validation, status alerts, and mutation calls.",
  "frontend/src/components/StripeConfigModal.tsx": "Empty or placeholder file for Stripe configuration modal.",
  "frontend/src/components/WelcomeAccountSetup.tsx": "Multi-step onboarding UI that collects profile and preference data, saves it via backend mutations, and navigates the user after completion.",
  "frontend/src/hooks/useActor.ts": "Creates and updates an authenticated or anonymous backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, manages login flow, stored identities, and exposes login/clear methods.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, subscriptions, friends, KYC, and signaling operations using the backend actor.",
  "frontend/src/hooks/useWebRTC.ts": "Implements a full WebRTC connection manager with TURN-only ICE config, signaling integration, retries, diagnostics, and media handling.",
  "frontend/src/hooks/useYouTubeIFramePlayer.ts": "Loads the YouTube IFrame API and manages a player instance with play, pause, seek, events, and cleanup logic.",
  "frontend/src/index.css": "Defines Tailwind setup, light/dark theme variables, custom animations, and accessibility/contrast utilities.",
  "frontend/src/lib/youtube.ts": "Provides helpers to parse YouTube URLs or IDs and generate embed URLs.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/FriendsPage.tsx": "Implements friends list UI with chat, calls, and navigation to view-together.",
  "frontend/src/pages/HomePage.tsx": "Home screen handling login, user profile checks, and navigation to matching or onboarding.",
  "frontend/src/pages/MatchingPage.tsx": "Handles voice matching flow, WebRTC connection state, and profile/subscription checks.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays payment failure reasons with guidance and retry/navigation options.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Razorpay payment via URL params, refreshes subscription data, and displays success or error states with feature activation UI.",
  "frontend/src/pages/ProfilePage.tsx": "Loads and edits user profile data, saves updates, and allows triggering KYC verification.",
  "frontend/src/pages/SubscriptionPage.tsx": "Displays subscription plans and handles Razorpay order creation, payment flow, and verification.",
  "frontend/src/pages/ViewTogetherPage.tsx": "Synchronizes shared YouTube playback between peers using backend session state and an embedded IFrame player.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, TURN-only WebRTC requirement status, and current feature request tracking."
}