{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "WebRTC random-stranger video chat website with onboarding; users report inability to search/connect and WebRTC calls stuck on “connecting” with no error. User asks whether a database can support matchmaking/presence.",
  "architectural_notes": [
    "Random-stranger WebRTC requires matchmaking + signaling (offer/answer/ICE) plus STUN/TURN; consider persisting presence/match state in a database or fast store to coordinate live users."
  ],
  "known_issues": [
    "WebRTC calls with random people get stuck on “connecting” indefinitely with no message/error."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-fix-the-frontend-webrtc-flow-so-the-user-never-sees-an-indefinite-connecting-state-with-no-message-ensure-the-existing-timeout-logic-in-the-webrtc-hook-reliably-triggers-and-surfaces-an-error-when-no-answer-ice-progress-occurs-and-ensure-matchingpage-reacts-by-returning-to-idle-and-offering-a-retry-next-action",
      "title": "Fix the frontend WebRTC flow so the user never sees an indefinite “connecting” state with no message. Ensure the existing timeout logic in the WebRTC hook reliably triggers and surfaces an error when no answer/ICE progress occurs, and ensure MatchingPage reacts by returning to idle and offering a retry/next action.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-improve-user-facing-diagnostics-on-the-matching-page-during-connection-attempts-show-a-clear-status-message-while-searching-connecting-and-provide-a-collapsible-diagnostics-panel-that-exposes-key-webrtc-diagnostic-fields-already-tracked-signalingstate-iceconnectionstate-icegatheringstate-connectionstate-retryattempts-usingturnserver",
      "title": "Improve user-facing diagnostics on the Matching page during connection attempts: show a clear status message while searching/connecting, and provide a collapsible diagnostics panel that exposes key WebRTC diagnostic fields already tracked (signalingState, iceConnectionState, iceGatheringState, connectionState, retryAttempts, usingTurnServer).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Database-backed presence + matchmaking queue for random-stranger chat (track available users, match pairs, handle next/leave)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add connection diagnostics/feedback when WebRTC is stuck (timeouts, error messages, retry/next behavior)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Update the backend matchmaking API so that attempting to find a peer never traps just because no peers are available. Specifically, change matchmaking to return a safe “no peer available” result (e.g., null/optional) instead of Debug.trap when the active pool is empty, and ensure callers can distinguish between (a) not onboarded, (b) not active, and (c) no peers currently available.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Implement database-like, persistent backend state for presence and matchmaking so the app can reliably support “random stranger” matching. Store and manage: (1) who is currently online/active, (2) who is currently waiting to be matched, and (3) current active pairings, with support for users leaving/next/end. Use Internet Computer canister stable state so this data is not lost on upgrade.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Add backend-side signaling/session cleanup rules so that stale signaling records cannot cause the UI to remain in “connecting” with no feedback. Add expiration/cleanup logic based on SignalingData.lastUpdated, and ensure a caller can explicitly clean up signaling state with a peer when retrying or skipping.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "If adding stable persistent state changes the backend actor state layout, implement a conditional Motoko migration in backend/migration.mo so existing deployed state can be upgraded without data loss or traps.",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix WebRTC matchmaking stuck on “connecting” and add persistent presence/matchmaking state",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}